In [6]:
import pandas as pd

In [15]:
#Series
values = [10,20,30,40]
s = pd.Series(values, index=['a', 'b','c', 'd'])
s.loc['a']

#Data Frame:
df = pd.DataFrame({

    'name' : ['mike', 'bob' , 'Raj' ],
    'age' : [19, 20,18],
    'branch' : ['CSE', 'IT', 'DS']
})
df = df.set_index('name')
df

      age branch
name
mike   19    CSE
bob    20     IT
Raj    18     DS

In [16]:
df.loc['Raj']

age       18
branch    DS
Name: Raj, dtype: object

In [21]:
df1 = pd.DataFrame({
'a': [1,2,3,4]
    
})

df2 = pd.DataFrame({

'a' : [5,6,7,8]
    
})

In [22]:
df1+df2

    a
0   6
1   8
2  10
3  12